* kinds of
* eos
* TODO veos, the first target and being cve
* ceos
* TODO and more?
* DONE ip

#+BEGIN_SRC 
zerotouch cancel
conf t
interface management 1
ip address 192.168.25.160/24
exit
ip route 0.0.0.0/0 192.168.25.1
exit
wr
#+END_SRC

* DONE hostname

#+BEGIN_SRC 
hostname v160
#+END_SRC

* DONE about time

#+BEGIN_SRC 
clock timezone Asia/Seoul
ntp server 192.168.25.211 prefer
#+END_SRC

* DONE password

- https://www.arista.com/assets/data/pdf/qsg/qsg-7500-series/Chapters/qsg-7500-series_05_Configuring_the_Switch.pdf

#+BEGIN_SRC 
username admin secret pxq123

username john secret x245

enable password xyrt1
#+END_SRC

* TODO enable scp

aaa authorization exec default local

* TODO upgrade

- download
  - [2023-07-31 월] EOS-4.29.4M.swi
    - 32bit
    - with M not F
      - https://www.arista.com/en/support/product-documentation/eos-life-cycle-policy
- https://www.arista.com/en/um-eos/eos-standard-upgrades-and-downgrade

** steps

dir flash1:
dir usb1:
copy usb1:/EOS-4.29.4M.swi flash:/EOS-4.29.4M.swi
dir flash:
show boot-config
conf t
boot system flash:/EOS-4.13.2.swi
show boot-config
write
reload
show version | grep Software

* usb mount and eject

- mount automatically
- eject usb1

* text file

- copy terminal: usb1:/eos_up.txt

* DONE config backup and restore

- copy running-config running-config_20240103_1
- configure replace flash:running-config_20240103_1
* TODO ssh

#+BEGIN_SRC bash
bash
Cli -p 15 -c 'show ip access-list default-control-plane-acl' > default-control-plane-acl
cat default-control-plane-acl |sed -e 's/\[.*\]//' -e 's/default-control-plane-acl/ssh-control-plane-acl2/' -e 's/Access List/access-list/'
#+END_SRC

#+BEGIN_SRC 
show ip access-lists default-control-plane-acl | sed -e 's/\[.*\]//' -e 's/default-control-plane-acl/ssh-control-plane-acl2/' -e 's/Access List/access-list/'
arista1(config-acl-ssh-control-plane-acl2)#permit tcp any any eq 2022
#+END_SRC

* DONE ssh custom port/acl to vrf MGMT

- [2024-01-04 목] confirm

** process

- ms1 to ns(vrf MGMT)
#+begin_example
vrf instance MGMT
int ma1
  vrf MGMT
  ip address 192.168.25.165/24
#+end_example

- (opt1) modify service acl to support 20022
#+begin_example
sh ip access-lists default-control-plane-acl | redirect flash:cpacl.txt
cd /mnt/flash
sudo sed -i "s/\[.*//" cpacl.txt
#+end_example

#+begin_example
conf t
ip access-list custom-acl
  280 permit tcp any any eq 20022
#+end_example

- (opt1)apply service acl
#+begin_example
system control-plane
  ip access-group custom-acl vrf MGMT in
#+end_example

- acl to permit talk
#+begin_example
conf t
ip access-list vtyacl
  160 permit tcp host 192.168.25.193 any eq 20022
  170 permit tcp host 192.168.25.193 any eq 22
#+end_example
  
- apply to ssh
#+begin_example
management ssh
  ip access-group vtyacl vrf MGMT in
  service-port 20022
#+end_example

* DONE configure session

#+begin_example
  v111y26#configure session s1 description shut
  v111y26(config-s-s1)#interface ethernet 11
  v111y26(config-s-s1-if-Et11)#shutdown 
  v111y26(config-s-s1-if-Et11)#exit
  v111y26(config-s-s1)#exit
  v111y26#show configuration sessions 
  Maximum number of completed sessions: 1
  Maximum number of pending sessions: 5

    Name    State         User       Terminal    Description
    ---- ------------- ---------- -------------- -----------
    s1      pending                              shut       

  v111y26(config-s-s1)#show session-config diffs 
  --- system:/running-config
  +++ session:/s1-session-config
  @@ -54,6 +54,7 @@
   interface Ethernet10
   !
   interface Ethernet11
  +   shutdown
   !
   interface Ethernet12
   !
  v111y26(config-s-s1)#commit
  v111y26#

  v111y26#configure session s2 description test
  v111y26(config-s-s2)#exit
  v111y26#configure session s3 description test
  v111y26(config-s-s3)#exit
  v111y26#show configuration sessions
  Maximum number of completed sessions: 1
  Maximum number of pending sessions: 5

    Name    State         User       Terminal    Description
    ---- ------------- ---------- -------------- -----------
    s2      pending                              test       
    s3      pending                              test       

  v111y26#configure session s2 abort 
  v111y26#configure session s3 abort
  v111y26#configure session s3 abort
  % Cannot abort non-existent session s3.
  v111y26#
#+end_example
